Revit 2027 API
AnalyticalEquipmentLoadData.ApparentLoad Property
 The electrical apparent load of analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApparentLoad { get; set; }
Public Property ApparentLoad As Double
	Get
	Set
public:
property double ApparentLoad {
	double get ();
	void set (double value);
}
member ApparentLoad : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for value is not a number -or- When setting this property: The given value for value is not finite
ArgumentOutOfRangeException |  When setting this property: The given value for value must be non-negative.
See Also
Reference
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace